API/app/Libraries/plpxLogger.php

    public function loggerUsuario(LogUsuario $lUsuario)
    {
        $logModel = new LogUsuarioModel();
        $logModel->insert($lUsuario);
---
INSERT INTO `logs_usuarios` (`log_controller`, `log_method`, `log_request_ip`, `log_inserted_at`, `log_usuario_id`, `log_usuario`, `log_usuario_correo`, `log_accion`, `log_mensaje`, `log_mensaje_json`, `log_request_respond`, `log_linea`) VALUES ('API/v1/Usuarios', 'login', '::1', '2023-05-08 20:55:30', '36', NULL, 'c.dzul@hotmail.com', 'Iniciar sesión', 'Password incorrecto', NULL, 'invalid_request - Correo y/o contraseña inválidos.', NULL)

    public function loggerSistema(LogSistema $lSistema)
    {
        $logModel = new LogSistemaModel();
        $logModel->insert($lSistema);
---
INSERT INTO `logs_sistema` (`logsis_controller`, `logsis_method`, `logsis_request_ip`, `logsis_inserted_at`, `logsis_tipo`, `logsis_accion`, `logsis_mensaje`, `logsis_mensaje_json`, `logsis_request_respond`, `logsis_linea`) VALUES ('API/v1/Usuarios', 'login', '::1', '2023-05-08 21:29:12', 'notice', 'Iniciar sesión', 'Datos no pasaron validación', NULL, 'invalid_request', 107)