API/app/Controllers/API/v1/Usuarios.php

SELECT `usu_id`, `usu_usuario`, `usu_password`, `usu_correo`, `usu_nombre`, `usu_apellido`, `usu_tipo`, `usu_sta`
FROM `usuarios`
WHERE `usu_correo` = 'c.dzul@hotmail.com'
 LIMIT 1
---
	public function login()
	{
		$logAccion = "Iniciar sesión";
		//echo $this->request->getVar();
		//var_dump($this->request->getPost());
		//return;
		if (!loginValidator($this->request->getPost(), $errors)) {
			$dataLog = [
				"mensaje" => lang("Common.errorDatosValidacion"),
				"mensaje_objeto" => $errors,
				"request_respond" => "invalid_request",
			];

			$this->logSistema(["tipo" => "notice", "accion" => $logAccion, "linea" => __LINE__, ...$dataLog]);
			return $this->apiResponseError("invalid_request", $errors);
		}

		$correo = $this->request->getPost("correo");
		$contrasena = $this->request->getPost("contrasena");

		$usuarioModel = new UsuarioModel();

		$usuario = $usuarioModel
			->select("usu_id,usu_usuario,usu_password,usu_correo,usu_nombre,usu_apellido,usu_tipo,usu_sta")
			->where("usu_correo", $correo)
			->first();